# FbxLightInitialColorCtrl Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightInitialColorCtrl Property
ParameterTypeId Class See Also
---
"Initial Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightInitialColorCtrl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightInitialColorCtrl As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightInitialColorCtrl {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace